tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

// Coordinates: x = horizontal, y = empty-direction thickness, z = vertical.
// The out-of-plane thickness pi*D/4 preserves the circular pipe area D*pi*D/4.
vertices
(
    (-1.8300 0                 -0.0127) // 0: Figure 1, 0.31 m upstream of air tee centre
    (-1.8300 0                  0.0127) // 1
    (-1.8300 0.0199491133502952 -0.0127) // 2
    (-1.8300 0.0199491133502952  0.0127) // 3

    (-1.5327 0                 -0.0127) // 4: air tee centre x = -1.52 m
    (-1.5327 0                  0.0127) // 5
    (-1.5327 0.0199491133502952 -0.0127) // 6
    (-1.5327 0.0199491133502952  0.0127) // 7

    (-1.5073 0                 -0.0127) // 8
    (-1.5073 0                  0.0127) // 9
    (-1.5073 0.0199491133502952 -0.0127) // 10
    (-1.5073 0.0199491133502952  0.0127) // 11

    (-0.0127 0                 -0.0127) // 12
    (-0.0127 0                  0.0127) // 13
    (-0.0127 0.0199491133502952 -0.0127) // 14
    (-0.0127 0.0199491133502952  0.0127) // 15

    ( 0.0127 0                 -0.0127) // 16
    ( 0.0127 0                  0.0127) // 17
    ( 0.0127 0.0199491133502952 -0.0127) // 18
    ( 0.0127 0.0199491133502952  0.0127) // 19

    ( 1.2700 0                 -0.0127) // 20
    ( 1.2700 0                  0.0127) // 21
    ( 1.2700 0.0199491133502952 -0.0127) // 22
    ( 1.2700 0.0199491133502952  0.0127) // 23

    (-1.5327 0                  0.1500) // 24
    (-1.5327 0.0199491133502952  0.1500) // 25
    (-1.5073 0                  0.1500) // 26
    (-1.5073 0.0199491133502952  0.1500) // 27

    (-0.0127 0                  1.0200) // 28
    (-0.0127 0.0199491133502952  1.0200) // 29
    ( 0.0127 0                  1.0200) // 30
    ( 0.0127 0.0199491133502952  1.0200) // 31

    (-0.1000 0                  1.0200) // 32
    (-0.1000 0.0199491133502952  1.0200) // 33
    ( 0.1000 0                  1.0200) // 34
    ( 0.1000 0.0199491133502952  1.0200) // 35

    (-0.1000 0                  1.3000) // 36
    (-0.1000 0.0199491133502952  1.3000) // 37
    (-0.0127 0                  1.3000) // 38
    (-0.0127 0.0199491133502952  1.3000) // 39
    ( 0.0127 0                  1.3000) // 40
    ( 0.0127 0.0199491133502952  1.3000) // 41
    ( 0.1000 0                  1.3000) // 42
    ( 0.1000 0.0199491133502952  1.3000) // 43

    (-0.1000 0                  2.0000) // 44
    (-0.1000 0.0199491133502952  2.0000) // 45
    (-0.0127 0                  2.0000) // 46
    (-0.0127 0.0199491133502952  2.0000) // 47
    ( 0.0127 0                  2.0000) // 48
    ( 0.0127 0.0199491133502952  2.0000) // 49
    ( 0.1000 0                  2.0000) // 50
    ( 0.1000 0.0199491133502952  2.0000) // 51
);

blocks
(
    hex (0 4 6 2 1 5 7 3)          (187 1 16) simpleGrading (1 1 1)
    hex (4 8 10 6 5 9 11 7)        (16 1 16)  simpleGrading (1 1 1)
    hex (8 12 14 10 9 13 15 11)    (941 1 16) simpleGrading (1 1 1)
    hex (12 16 18 14 13 17 19 15)  (16 1 16)  simpleGrading (1 1 1)
    hex (16 20 22 18 17 21 23 19)  (792 1 16) simpleGrading (1 1 1)

    hex (5 9 11 7 24 26 27 25)     (16 1 86)  simpleGrading (1 1 1)
    hex (13 17 19 15 28 30 31 29)  (16 1 400) simpleGrading (1 1 1)

    hex (32 28 29 33 36 38 39 37)  (35 1 112) simpleGrading (1 1 1)
    hex (28 30 31 29 38 40 41 39)  (16 1 112) simpleGrading (1 1 1)
    hex (30 34 35 31 40 42 43 41)  (35 1 112) simpleGrading (1 1 1)
    hex (36 38 39 37 44 46 47 45)  (35 1 140) simpleGrading (1 1 1)
    hex (38 40 41 39 46 48 49 47)  (16 1 140) simpleGrading (1 1 1)
    hex (40 42 43 41 48 50 51 49)  (35 1 140) simpleGrading (1 1 1)
);

edges ();

boundary
(
    waterInlet
    {
        type patch;
        faces ((0 1 3 2));
    }
    waterOutlet
    {
        type patch;
        faces ((20 22 23 21));
    }
    airInlet
    {
        type patch;
        faces ((24 26 27 25));
    }
    ambientFloor
    {
        type patch;
        faces
        (
            (32 28 29 33)
            (30 34 35 31)
        );
    }
    ambientSides
    {
        type patch;
        faces
        (
            (32 33 37 36)
            (34 42 43 35)
            (36 37 45 44)
            (42 50 51 43)
        );
    }
    ambientTop
    {
        type patch;
        faces
        (
            (44 46 47 45)
            (46 48 49 47)
            (48 50 51 49)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 2 6 4)
            (4 6 10 8)
            (8 10 14 12)
            (12 14 18 16)
            (16 18 22 20)

            (1 5 7 3)
            (9 13 15 11)
            (17 21 23 19)

            (5 24 25 7)
            (9 11 27 26)
            (13 28 29 15)
            (17 19 31 30)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1) (2 3 7 6)
            (4 8 9 5) (6 7 11 10)
            (8 12 13 9) (10 11 15 14)
            (12 16 17 13) (14 15 19 18)
            (16 20 21 17) (18 19 23 22)
            (5 9 26 24) (7 25 27 11)
            (13 17 30 28) (15 29 31 19)
            (32 28 38 36) (33 37 39 29)
            (28 30 40 38) (29 39 41 31)
            (30 34 42 40) (31 41 43 35)
            (36 38 46 44) (37 45 47 39)
            (38 40 48 46) (39 47 49 41)
            (40 42 50 48) (41 49 51 43)
        );
    }
);

mergePatchPairs ();
