tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/case/system/setExprFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}

// Construct an internally consistent absolute-pressure field.  The primary
// pressure solve uses p_rgh, but compressibleInterFoam reads p first when it
// constructs the phase densities, so a uniform p seed would launch a false
// hydrostatic transient.
expressions
(
    ambientAirPressure
    {
        field       p;
        dimensions  [1 -1 -2 0 0 0 0];
        expression  "101325 + 1.204317575*9.81*(1.02-pos().z())";
    }

    mainPipeWaterPressure
    {
        field       p;
        dimensions  [1 -1 -2 0 0 0 0];
        fieldMask   "(pos().z() >= -0.0128) && (pos().z() <= 0.0128)";
        expression  "101325 + 1.204317575*9.81*(1.02-0.5842) + 998.4*9.81*(0.5842-pos().z())";
    }

    riserWaterPressure
    {
        field       p;
        dimensions  [1 -1 -2 0 0 0 0];
        fieldMask
        #{
            (pos().x() >= -0.0128) && (pos().x() <= 0.0128)
         && (pos().z() > 0.0126) && (pos().z() <= 0.5842)
        #};
        expression  "101325 + 1.204317575*9.81*(1.02-0.5842) + 998.4*9.81*(0.5842-pos().z())";
    }

    closedWaterStubPressure
    {
        field       p;
        dimensions  [1 -1 -2 0 0 0 0];
        fieldMask
        #{
            (pos().x() >= -1.5328) && (pos().x() <= -1.5072)
         && (pos().z() > 0.0126) && (pos().z() <= 0.1501)
        #};
        expression  "101325 + 1.204317575*9.81*(1.02-0.5842) + 998.4*9.81*(0.5842-pos().z())";
    }
);
